{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": { "Fixed": 64 },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_token": "[PAD]",
    "pad_type_id": 0,
    "pad_id": 0
  },
  "added_tokens": [
    {
      "id": 0, "content": "[PAD]",
      "single_word": false, "lstrip": false, "rstrip": false,
      "normalized": false, "special": true
    },
    {
      "id": 1, "content": "[UNK]",
      "single_word": false, "lstrip": false, "rstrip": false,
      "normalized": false, "special": true
    }
  ],
  "normalizer": { "type": "Lowercase" },
  "pre_tokenizer": { "type": "Whitespace" },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "cat": 2,
      "dog": 3,
      "mountain": 4,
      "sunset": 5,
      "hello": 6,
      "world": 7,
      "a": 8,
      "photo": 9,
      "of": 10
    }
  }
}
